{
    "page_content": "# LangGraph CLI¶\n\nPrerequisites\n\n  * LangGraph Platform\n  * LangGraph Server\n\n\n\nThe LangGraph CLI is a multi-platform command-line tool for building and running the LangGraph API server locally. This offers an alternative to the LangGraph Studio desktop app for developing and testing agents across all major operating systems (Linux, Windows, MacOS). The resulting server includes all API endpoints for your graph's runs, threads, assistants, etc. as well as the other services required to run your agent, including a managed database for checkpointing and storage.\n\n## Installation¶\n\nThe LangGraph CLI can be installed via Homebrew (on macOS) or pip:\n\nHomebrewpip\n[code] \n    brew install langgraph-cli\n    \n[/code]\n[code] \n    pip install langgraph-cli\n    \n[/code]\n\n## Commands¶\n\nThe CLI provides the following core functionality:\n\n### `build`¶\n\nThe `langgraph build` command builds a Docker image for the LangGraph API server that can be directly deployed.\n\n### `dev`¶\n\nNew in version 0.1.55\n\nThe `langgraph dev` command was introduced in langgraph-cli version 0.1.55.\n\nPython only\n\nCurrently, the CLI only supports Python >= 3.11. JS support is coming soon.\n\nThe `langgraph dev` command starts a lightweight development server that requires no Docker installation. This server is ideal for rapid development and testing, with features like:\n\n  * Hot reloading: Changes to your code are automatically detected and reloaded\n  * Debugger support: Attach your IDE's debugger for line-by-line debugging\n  * In-memory state with local persistence: Server state is stored in memory for speed but persisted locally between restarts\n\n\n\nTo use this command, you need to install the CLI with the \"inmem\" extra:\n[code] \n    pip install -U \"langgraph-cli[inmem]\"\n    \n[/code]\n\n**Note** : This command is intended for local development and testing only. It is not recommended for production use. Since it does not use Docker, we recommend using virtual environments to manage your project's dependencies.\n\n### `up`¶\n\nThe `langgraph up` command starts an instance of the LangGraph API server locally in a docker container. This requires thedocker server to be running locally. It also requires a LangSmith API key for local development or a license key for production use.\n\nThe server includes all API endpoints for your graph's runs, threads, assistants, etc. as well as the other services required to run your agent, including a managed database for checkpointing and storage.\n\n### `dockerfile`¶\n\nThe `langgraph dockerfile` command generates a Dockerfile that can be used to build images for and deploy instances of the LangGraph API server. This is useful if you want to further customize the dockerfile or deploy in a more custom way.\n\nUpdating your langgraph.json file\n\nThe `langgraph dockerfile` command translates all the configuration in your `langgraph.json` file into Dockerfile commands. When using this command, you will have to re-run it whenever you update your `langgraph.json` file. Otherwise, your changes will not be reflected when you build or run the dockerfile.\n\n## Related¶\n\n  * LangGraph CLI API Reference\n\n\n\n## Comments\n",
    "metadata": {
        "url": "https://langchain-ai.github.io/langgraph/concepts/langgraph_cli/",
        "title": "LangGraph CLI",
        "description": "Build language agents as graphs",
        "keywords": "No keywords"
    }
}