{
    "page_content": "# How-to Guides¶\n\nHere you’ll find answers to “How do I...?” types of questions. These guides are **goal-oriented** and concrete; they're meant to help you complete a specific task. For conceptual explanations see the Conceptual guide. For end-to-end walk-throughs see Tutorials. For comprehensive descriptions of every class and function see the API Reference.\n\n## LangGraph¶\n\n### Graph API Basics¶\n\n  * How to update graph state from nodes\n  * How to create a sequence of steps\n  * How to create branches for parallel execution\n  * How to create and control loops with recursion limits\n  * How to visualize your graph\n\n\n\n### Fine-grained Control¶\n\nThese guides demonstrate LangGraph features that grant fine-grained control over the execution of your graph.\n\n  * How to create map-reduce branches for parallel execution\n  * How to update state and jump to nodes in graphs and subgraphs\n  * How to add runtime configuration to your graph\n  * How to add node retries\n  * How to return state before hitting recursion limit\n\n\n\n### Persistence¶\n\nLangGraph Persistence makes it easy to persist state across graph runs (per-thread persistence) and across threads (cross-thread persistence). These how-to guides show how to add persistence to your graph.\n\n  * How to add thread-level persistence to your graph\n  * How to add thread-level persistence to a subgraph\n  * How to add cross-thread persistence to your graph\n  * How to use Postgres checkpointer for persistence\n  * How to use MongoDB checkpointer for persistence\n  * How to create a custom checkpointer using Redis\n\n\n\nSee the below guides for how-to add persistence to your workflow using the (beta) Functional API:\n\n  * How to add thread-level persistence (functional API)\n  * How to add cross-thread persistence (functional API)\n\n\n\n### Memory¶\n\nLangGraph makes it easy to manage conversation memory in your graph. These how-to guides show how to implement different strategies for that.\n\n  * How to manage conversation history\n  * How to delete messages\n  * How to add summary conversation memory\n  * How to add long-term memory (cross-thread)\n  * How to use semantic search for long-term memory\n\n\n\n### Human-in-the-loop¶\n\nHuman-in-the-loop functionality allows you to involve humans in the decision-making process of your graph. These how-to guides show how to implement human-in-the-loop workflows in your graph.\n\nKey workflows:\n\n  * How to wait for user input: A basic example that shows how to implement a human-in-the-loop workflow in your graph using the `interrupt` function.\n  * How to review tool calls: Incorporate human-in-the-loop for reviewing/editing/accepting tool call requests before they executed using the `interrupt` function.\n\n\n\nOther methods:\n\n  * How to add static breakpoints: Use for debugging purposes. For **human-in-the-loop** workflows, we recommend the `interrupt` function instead.\n  * How to edit graph state: Edit graph state using `graph.update_state` method. Use this if implementing a **human-in-the-loop** workflow via **static breakpoints**.\n  * How to add dynamic breakpoints with `NodeInterrupt`: **Not recommended** : Use the `interrupt` function instead.\n\n\n\nSee the below guides for how-to implement human-in-the-loop workflows with the (beta) Functional API:\n\n  * How to wait for user input (Functional API)\n  * How to review tool calls (Functional API)\n\n\n\n### Time Travel¶\n\nTime travel allows you to replay past actions in your LangGraph application to explore alternative paths and debug issues. These how-to guides show how to use time travel in your graph.\n\n  * How to view and update past graph state\n\n\n\n### Streaming¶\n\nStreaming is crucial for enhancing the responsiveness of applications built on LLMs. By displaying output progressively, even before a complete response is ready, streaming significantly improves user experience (UX), particularly when dealing with the latency of LLMs.\n\n  * How to stream\n  * How to stream LLM tokens\n  * How to stream LLM tokens from specific nodes\n  * How to stream data from within a tool\n  * How to stream from subgraphs\n  * How to disable streaming for models that don't support it\n\n\n\n### Tool calling¶\n\nTool calling is a type of chat model API that accepts tool schemas, along with messages, as input and returns invocations of those tools as part of the output message.\n\nThese how-to guides show common patterns for tool calling with LangGraph:\n\n  * How to call tools using ToolNode\n  * How to handle tool calling errors\n  * How to pass runtime values to tools\n  * How to pass config to tools\n  * How to update graph state from tools\n  * How to handle large numbers of tools\n\n\n\n### Subgraphs¶\n\nSubgraphs allow you to reuse an existing graph from another graph. These how-to guides show how to use subgraphs:\n\n  * How to use subgraphs\n  * How to view and update state in subgraphs\n  * How to transform inputs and outputs of a subgraph\n\n\n\n### Multi-agent¶\n\nMulti-agent systems are useful to break down complex LLM applications into multiple agents, each responsible for a different part of the application. These how-to guides show how to implement multi-agent systems in LangGraph:\n\n  * How to implement handoffs between agents\n  * How to build a multi-agent network\n  * How to add multi-turn conversation in a multi-agent application\n\n\n\nSee the multi-agent tutorials for implementations of other multi-agent architectures.\n\nSee the below guides for how to implement multi-agent workflows with the (beta) Functional API:\n\n  * How to build a multi-agent network (functional API)\n  * How to add multi-turn conversation in a multi-agent application (functional API)\n\n\n\n### State Management¶\n\n  * How to use Pydantic model as graph state\n  * How to define input/output schema for your graph\n  * How to pass private state between nodes inside the graph\n\n\n\n### Other¶\n\n  * How to run graph asynchronously\n  * How to force tool-calling agent to structure output\n  * How to pass custom LangSmith run ID for graph runs\n  * How to integrate LangGraph with AutoGen, CrewAI, and other frameworks\n\n\n\nSee the below guide for how to integrate with other frameworks using the (beta) Functional API:\n\n  * How to integrate LangGraph (functional API) with AutoGen, CrewAI, and other frameworks\n\n\n\n### Prebuilt ReAct Agent¶\n\nThe LangGraph prebuilt ReAct agent is pre-built implementation of a tool calling agent.\n\nOne of the big benefits of LangGraph is that you can easily create your own agent architectures. So while it's fine to start here to build an agent quickly, we would strongly recommend learning how to build your own agent so that you can take full advantage of LangGraph.\n\nThese guides show how to use the prebuilt ReAct agent:\n\n  * How to use the pre-built ReAct agent\n  * How to add thread-level memory to a ReAct Agent\n  * How to add a custom system prompt to a ReAct agent\n  * How to add human-in-the-loop processes to a ReAct agent\n  * How to return structured output from a ReAct agent\n  * How to add semantic search for long-term memory to a ReAct agent\n\n\n\nInterested in further customizing the ReAct agent? This guide provides an overview of its underlying implementation to help you customize for your own needs:\n\n  * How to create prebuilt ReAct agent from scratch\n\n\n\nSee the below guide for how-to build ReAct agents with the (beta) Functional API:\n\n  * How to create a ReAct agent from scratch (Functional API)\n\n\n\n## LangGraph Platform¶\n\nThis section includes how-to guides for LangGraph Platform.\n\nLangGraph Platform is a commercial solution for deploying agentic applications in production, built on the open-source LangGraph framework.\n\nThe LangGraph Platform offers a few different deployment options described in the deployment options guide.\n\nTip\n\n  * LangGraph is an MIT-licensed open-source library, which we are committed to maintaining and growing for the community.\n  * You can always deploy LangGraph applications on your own infrastructure using the open-source LangGraph project without using LangGraph Platform.\n\n\n\n### Application Structure¶\n\nLearn how to set up your app for deployment to LangGraph Platform:\n\n  * How to set up app for deployment (requirements.txt)\n  * How to set up app for deployment (pyproject.toml)\n  * How to set up app for deployment (JavaScript)\n  * How to add semantic search\n  * How to customize Dockerfile\n  * How to test locally\n  * How to rebuild graph at runtime\n  * How to use LangGraph Platform to deploy CrewAI, AutoGen, and other frameworks\n\n\n\n### Deployment¶\n\nLangGraph applications can be deployed using LangGraph Cloud, which provides a range of services to help you deploy, manage, and scale your applications.\n\n  * How to deploy to LangGraph cloud\n  * How to deploy to a self-hosted environment\n  * How to interact with the deployment using RemoteGraph\n\n\n\n### Authentication & Access Control¶\n\n  * How to add custom authentication\n  * How to update the security schema of your OpenAPI spec\n\n\n\n### Assistants¶\n\nAssistants is a configured instance of a template.\n\nSee SDK Reference for supported endpoints and other details.\n\n  * How to configure agents\n  * How to version assistants\n\n\n\n### Threads¶\n\nSee SDK Reference for supported endpoints and other details.\n\n  * How to copy threads\n  * How to check status of your threads\n\n\n\n### Runs¶\n\nLangGraph Platform supports multiple types of runs besides streaming runs.\n\n  * How to run an agent in the background\n  * How to run multiple agents in the same thread\n  * How to create cron jobs\n  * How to create stateless runs\n\n\n\n### Streaming¶\n\nStreaming the results of your LLM application is vital for ensuring a good user experience, especially when your graph may call multiple models and take a long time to fully complete a run. Read about how to stream values from your graph in these how to guides:\n\n  * How to stream values\n  * How to stream updates\n  * How to stream messages\n  * How to stream events\n  * How to stream in debug mode\n  * How to stream multiple modes\n\n\n\n### Human-in-the-loop¶\n\nWhen designing complex graphs, relying entirely on the LLM for decision-making can be risky, particularly when it involves tools that interact with files, APIs, or databases. These interactions may lead to unintended data access or modifications, depending on the use case. To mitigate these risks, LangGraph allows you to integrate human-in-the-loop behavior, ensuring your LLM applications operate as intended without undesirable outcomes.\n\n  * How to add a breakpoint\n  * How to wait for user input\n  * How to edit graph state\n  * How to replay and branch from prior states\n  * How to review tool calls\n\n\n\n### Double-texting¶\n\nGraph execution can take a while, and sometimes users may change their mind about the input they wanted to send before their original input has finished running. For example, a user might notice a typo in their original request and will edit the prompt and resend it. Deciding what to do in these cases is important for ensuring a smooth user experience and preventing your graphs from behaving in unexpected ways.\n\n  * How to use the interrupt option\n  * How to use the rollback option\n  * How to use the reject option\n  * How to use the enqueue option\n\n\n\n### Webhooks¶\n\n  * How to integrate webhooks\n\n\n\n### Cron Jobs¶\n\n  * How to create cron jobs\n\n\n\n### LangGraph Studio¶\n\nLangGraph Studio is a built-in UI for visualizing, testing, and debugging your agents.\n\n  * How to connect to a LangGraph Cloud deployment\n  * How to connect to a local dev server\n  * How to connect to a local deployment (Docker)\n  * How to test your graph in LangGraph Studio (MacOS only)\n  * How to interact with threads in LangGraph Studio\n  * How to add nodes as dataset examples in LangGraph Studio\n\n\n\n## Troubleshooting¶\n\nThese are the guides for resolving common errors you may find while building with LangGraph. Errors referenced below will have an `lc_error_code` property corresponding to one of the below codes when they are thrown in code.\n\n  * GRAPH_RECURSION_LIMIT\n  * INVALID_CONCURRENT_GRAPH_UPDATE\n  * INVALID_GRAPH_NODE_RETURN_VALUE\n  * MULTIPLE_SUBGRAPHS\n  * INVALID_CHAT_HISTORY\n\n\n\n### LangGraph Platform Troubleshooting¶\n\nThese guides provide troubleshooting information for errors that are specific to the LangGraph Platform.\n\n  * INVALID_LICENSE\n\n\n\n## Comments\n",
    "metadata": {
        "url": "https://langchain-ai.github.io/langgraph/how-tos/",
        "title": "How-to Guides",
        "description": "How to accomplish common tasks in LangGraph",
        "keywords": "No keywords"
    }
}