{
    "page_content": "# Tutorials¶\n\nNew to LangGraph or LLM app development? Read this material to get up and running building your first applications.\n\n## Get Started 🚀¶\n\n  * LangGraph Quickstart: Build a chatbot that can use tools and keep track of conversation history. Add human-in-the-loop capabilities and explore how time-travel works.\n  * Common Workflows: Overview of the most common workflows using LLMs implemented with LangGraph.\n  * LangGraph Server Quickstart: Launch a LangGraph server locally and interact with it using REST API and LangGraph Studio Web UI.\n  * LangGraph Template Quickstart: Start building with LangGraph Platform using a template application.\n  * Deploy with LangGraph Cloud Quickstart: Deploy a LangGraph app using LangGraph Cloud.\n\n\n\n## Use cases 🛠️¶\n\nExplore practical implementations tailored for specific scenarios:\n\n### Chatbots¶\n\n  * Customer Support: Build a multi-functional support bot for flights, hotels, and car rentals.\n  * Prompt Generation from User Requirements: Build an information gathering chatbot.\n  * Code Assistant: Build a code analysis and generation assistant.\n\n\n\n### RAG¶\n\n  * Agentic RAG: Use an agent to figure out how to retrieve the most relevant information before using the retrieved information to answer the user's question.\n  * Adaptive RAG: Adaptive RAG is a strategy for RAG that unites (1) query analysis with (2) active / self-corrective RAG. Implementation of: https://arxiv.org/abs/2403.14403\n    * For a version that uses a local LLM: Adaptive RAG using local LLMs\n  * Corrective RAG: Uses an LLM to grade the quality of the retrieved information from the given source, and if the quality is low, it will try to retrieve the information from another source. Implementation of: https://arxiv.org/pdf/2401.15884.pdf\n    * For a version that uses a local LLM: Corrective RAG using local LLMs\n  * Self-RAG: Self-RAG is a strategy for RAG that incorporates self-reflection / self-grading on retrieved documents and generations. Implementation of https://arxiv.org/abs/2310.11511.\n    * For a version that uses a local LLM: Self-RAG using local LLMs\n  * SQL Agent: Build a SQL agent that can answer questions about a SQL database.\n\n\n\n### Agent Architectures¶\n\n#### Multi-Agent Systems¶\n\n  * Network: Enable two or more agents to collaborate on a task\n  * Supervisor: Use an LLM to orchestrate and delegate to individual agents\n  * Hierarchical Teams: Orchestrate nested teams of agents to solve problems\n\n\n\n#### Planning Agents¶\n\n  * Plan-and-Execute: Implement a basic planning and execution agent\n  * Reasoning without Observation: Reduce re-planning by saving observations as variables\n  * LLMCompiler: Stream and eagerly execute a DAG of tasks from a planner\n\n\n\n#### Reflection & Critique¶\n\n  * Basic Reflection: Prompt the agent to reflect on and revise its outputs\n  * Reflexion: Critique missing and superfluous details to guide next steps\n  * Tree of Thoughts: Search over candidate solutions to a problem using a scored tree\n  * Language Agent Tree Search: Use reflection and rewards to drive a monte-carlo tree search over agents\n  * Self-Discover Agent: Analyze an agent that learns about its own capabilities\n\n\n\n### Evaluation¶\n\n  * Agent-based: Evaluate chatbots via simulated user interactions\n  * In LangSmith: Evaluate chatbots in LangSmith over a dialog dataset\n\n\n\n### Experimental¶\n\n  * Web Research (STORM): Generate Wikipedia-like articles via research and multi-perspective QA\n  * TNT-LLM: Build rich, interpretable taxonomies of user intentand using the classification system developed by Microsoft for their Bing Copilot application.\n  * Web Navigation: Build an agent that can navigate and interact with websites\n  * Competitive Programming: Build an agent with few-shot \"episodic memory\" and human-in-the-loop collaboration to solve problems from the USA Computing Olympiad; adapted from the \"Can Language Models Solve Olympiad Programming?\" paper by Shi, Tang, Narasimhan, and Yao.\n  * Complex data extraction: Build an agent that can use function calling to do complex extraction tasks\n\n\n\n## LangGraph Platform 🧱¶\n\n### Authentication & Access Control¶\n\nAdd custom authentication and authorization to an existing LangGraph Platform deployment in the following three-part guide:\n\n  1. Setting Up Custom Authentication: Implement OAuth2 authentication to authorize users on your deployment\n  2. Resource Authorization: Let users have private conversations\n  3. Connecting an Authentication Provider: Add real user accounts and validate using OAuth2\n\n\n\n## Comments\n",
    "metadata": {
        "url": "https://langchain-ai.github.io/langgraph/tutorials/",
        "title": "Tutorials",
        "description": "Build language agents as graphs",
        "keywords": "No keywords"
    }
}