{
    "page_content": "# 🦜🕸️LangGraph¶\n\n⚡ Building language agents as graphs ⚡\n\nNote\n\nLooking for the JS version? See the JS repo and the JS docs.\n\n## Overview¶\n\nLangGraph is a library for building stateful, multi-actor applications with LLMs, used to create agent and multi-agent workflows. Check out an introductory tutorial here.\n\nLangGraph is inspired by Pregel and Apache Beam. The public interface draws inspiration from NetworkX. LangGraph is built by LangChain Inc, the creators of LangChain, but can be used without LangChain.\n\n### Why use LangGraph?¶\n\nLangGraph powers production-grade agents, trusted by Linkedin, Uber, Klarna, GitLab, and many more. LangGraph provides fine-grained control over both the flow and state of your agent applications. It implements a central persistence layer, enabling features that are common to most agent architectures:\n\n  * **Memory** : LangGraph persists arbitrary aspects of your application's state, supporting memory of conversations and other updates within and across user interactions;\n  * **Human-in-the-loop** : Because state is checkpointed, execution can be interrupted and resumed, allowing for decisions, validation, and corrections at key stages via human input.\n\n\n\nStandardizing these components allows individuals and teams to focus on the behavior of their agent, instead of its supporting infrastructure.\n\nThrough LangGraph Platform, LangGraph also provides tooling for the development, deployment, debugging, and monitoring of your applications.\n\nLangGraph integrates seamlessly with LangChain and LangSmith (but does not require them).\n\nTo learn more about LangGraph, check out our first LangChain Academy course, _Introduction to LangGraph_ , available for free here.\n\n### LangGraph Platform¶\n\nLangGraph Platform is infrastructure for deploying LangGraph agents. It is a commercial solution for deploying agentic applications to production, built on the open-source LangGraph framework. The LangGraph Platform consists of several components that work together to support the development, deployment, debugging, and monitoring of LangGraph applications: LangGraph Server (APIs), LangGraph SDKs (clients for the APIs), LangGraph CLI (command line tool for building the server), and LangGraph Studio (UI/debugger).\n\nSee deployment options here (includes a free tier).\n\nHere are some common issues that arise in complex deployments, which LangGraph Platform addresses:\n\n  * **Streaming support** : LangGraph Server provides multiple streaming modes optimized for various application needs\n  * **Background runs** : Runs agents asynchronously in the background\n  * **Support for long running agents** : Infrastructure that can handle long running processes\n  * **Double texting** : Handle the case where you get two messages from the user before the agent can respond\n  * **Handle burstiness** : Task queue for ensuring requests are handled consistently without loss, even under heavy loads\n\n\n\n## Installation¶\n[code] \n    pip install -U langgraph\n    \n[/code]\n\n## Example¶\n\nLet's build a tool-calling ReAct-style agent that uses a search tool!\n[code] \n    pip install langchain-anthropic\n    \n[/code]\n[code] \n    export ANTHROPIC_API_KEY=sk-...\n    \n[/code]\n\nOptionally, we can set up LangSmith for best-in-class observability.\n[code] \n    export LANGSMITH_TRACING=true\n    export LANGSMITH_API_KEY=lsv2_sk_...\n    \n[/code]\n\nThe simplest way to create a tool-calling agent in LangGraph is to use `create_react_agent`:\n\nHigh-level implementation\n[code] \n    from langgraph.prebuilt import create_react_agent\n    from langgraph.checkpoint.memory import MemorySaver\n    from langchain_anthropic import ChatAnthropic\n    from langchain_core.tools import tool\n    \n    # Define the tools for the agent to use\n    @tool\n    def search(query: str):\n        \"\"\"Call to surf the web.\"\"\"\n        # This is a placeholder, but don't tell the LLM that...\n        if \"sf\" in query.lower() or \"san francisco\" in query.lower():\n            return \"It's 60 degrees and foggy.\"\n        return \"It's 90 degrees and sunny.\"\n    \n    \n    tools = [search]\n    model = ChatAnthropic(model=\"claude-3-5-sonnet-latest\", temperature=0)\n    \n    # Initialize memory to persist state between graph runs\n    checkpointer = MemorySaver()\n    \n    app = create_react_agent(model, tools, checkpointer=checkpointer)\n    \n    # Use the agent\n    final_state = app.invoke(\n        {\"messages\": [{\"role\": \"user\", \"content\": \"what is the weather in sf\"}]},\n        config={\"configurable\": {\"thread_id\": 42}}\n    )\n    final_state[\"messages\"][-1].content\n    \n[/code]\n[code] \n    \"Based on the search results, I can tell you that the current weather in San Francisco is:\\n\\nTemperature: 60 degrees Fahrenheit\\nConditions: Foggy\\n\\nSan Francisco is known for its microclimates and frequent fog, especially during the summer months. The temperature of 60°F (about 15.5°C) is quite typical for the city, which tends to have mild temperatures year-round. The fog, often referred to as \"Karl the Fog\" by locals, is a characteristic feature of San Francisco\\'s weather, particularly in the mornings and evenings.\\n\\nIs there anything else you\\'d like to know about the weather in San Francisco or any other location?\"\n    \n[/code]\n\nNow when we pass the same `\"thread_id\"`, the conversation context is retained via the saved state (i.e. stored list of messages) \n[code]\n    final_state = app.invoke(\n        {\"messages\": [{\"role\": \"user\", \"content\": \"what about ny\"}]},\n        config={\"configurable\": {\"thread_id\": 42}}\n    )\n    final_state[\"messages\"][-1].content\n    \n[/code]\n[code] \n    \"Based on the search results, I can tell you that the current weather in New York City is:\\n\\nTemperature: 90 degrees Fahrenheit (approximately 32.2 degrees Celsius)\\nConditions: Sunny\\n\\nThis weather is quite different from what we just saw in San Francisco. New York is experiencing much warmer temperatures right now. Here are a few points to note:\\n\\n1. The temperature of 90°F is quite hot, typical of summer weather in New York City.\\n2. The sunny conditions suggest clear skies, which is great for outdoor activities but also means it might feel even hotter due to direct sunlight.\\n3. This kind of weather in New York often comes with high humidity, which can make it feel even warmer than the actual temperature suggests.\\n\\nIt's interesting to see the stark contrast between San Francisco's mild, foggy weather and New York's hot, sunny conditions. This difference illustrates how varied weather can be across different parts of the United States, even on the same day.\\n\\nIs there anything else you'd like to know about the weather in New York or any other location?\"\n    \n[/code]\n\nTip\n\nLangGraph is a **low-level** framework that allows you to implement any custom agent architectures. Click on the low-level implementation below to see how to implement a tool-calling agent from scratch.\n\nLow-level implementation\n[code] \n    from typing import Literal\n    \n    from langchain_anthropic import ChatAnthropic\n    from langchain_core.tools import tool\n    from langgraph.checkpoint.memory import MemorySaver\n    from langgraph.graph import END, START, StateGraph, MessagesState\n    from langgraph.prebuilt import ToolNode\n    \n    \n    # Define the tools for the agent to use\n    @tool\n    def search(query: str):\n        \"\"\"Call to surf the web.\"\"\"\n        # This is a placeholder, but don't tell the LLM that...\n        if \"sf\" in query.lower() or \"san francisco\" in query.lower():\n            return \"It's 60 degrees and foggy.\"\n        return \"It's 90 degrees and sunny.\"\n    \n    \n    tools = [search]\n    \n    tool_node = ToolNode(tools)\n    \n    model = ChatAnthropic(model=\"claude-3-5-sonnet-latest\", temperature=0).bind_tools(tools)\n    \n    # Define the function that determines whether to continue or not\n    def should_continue(state: MessagesState) -> Literal[\"tools\", END]:\n        messages = state['messages']\n        last_message = messages[-1]\n        # If the LLM makes a tool call, then we route to the \"tools\" node\n        if last_message.tool_calls:\n            return \"tools\"\n        # Otherwise, we stop (reply to the user)\n        return END\n    \n    \n    # Define the function that calls the model\n    def call_model(state: MessagesState):\n        messages = state['messages']\n        response = model.invoke(messages)\n        # We return a list, because this will get added to the existing list\n        return {\"messages\": [response]}\n    \n    \n    # Define a new graph\n    workflow = StateGraph(MessagesState)\n    \n    # Define the two nodes we will cycle between\n    workflow.add_node(\"agent\", call_model)\n    workflow.add_node(\"tools\", tool_node)\n    \n    # Set the entrypoint as `agent`\n    # This means that this node is the first one called\n    workflow.add_edge(START, \"agent\")\n    \n    # We now add a conditional edge\n    workflow.add_conditional_edges(\n        # First, we define the start node. We use `agent`.\n        # This means these are the edges taken after the `agent` node is called.\n        \"agent\",\n        # Next, we pass in the function that will determine which node is called next.\n        should_continue,\n    )\n    \n    # We now add a normal edge from `tools` to `agent`.\n    # This means that after `tools` is called, `agent` node is called next.\n    workflow.add_edge(\"tools\", 'agent')\n    \n    # Initialize memory to persist state between graph runs\n    checkpointer = MemorySaver()\n    \n    # Finally, we compile it!\n    # This compiles it into a LangChain Runnable,\n    # meaning you can use it as you would any other runnable.\n    # Note that we're (optionally) passing the memory when compiling the graph\n    app = workflow.compile(checkpointer=checkpointer)\n    \n    # Use the agent\n    final_state = app.invoke(\n        {\"messages\": [{\"role\": \"user\", \"content\": \"what is the weather in sf\"}]},\n        config={\"configurable\": {\"thread_id\": 42}}\n    )\n    final_state[\"messages\"][-1].content\n    \n[/code]\n\n**Step-by-step Breakdown** :  Initialize the model and tools.\n\n  * We use `ChatAnthropic` as our LLM. **NOTE:** we need to make sure the model knows that it has these tools available to call. We can do this by converting the LangChain tools into the format for OpenAI tool calling using the `.bind_tools()` method. \n  * We define the tools we want to use - a search tool in our case. It is really easy to create your own tools - see documentation here on how to do that here. \n\nInitialize graph with state.\n\n  * We initialize graph (`StateGraph`) by passing state schema (in our case `MessagesState`)\n  * `MessagesState` is a prebuilt state schema that has one attribute -- a list of LangChain `Message` objects, as well as logic for merging the updates from each node into the state.\n\nDefine graph nodes. There are two main nodes we need: \n\n  * The `agent` node: responsible for deciding what (if any) actions to take.\n  * The `tools` node that invokes tools: if the agent decides to take an action, this node will then execute that action.\n\nDefine entry point and graph edges. First, we need to set the entry point for graph execution - `agent` node. Then we define one normal and one conditional edge. Conditional edge means that the destination depends on the contents of the graph's state (`MessagesState`). In our case, the destination is not known until the agent (LLM) decides. \n\n  * Conditional edge: after the agent is called, we should either: \n    * a. Run tools if the agent said to take an action, OR\n    * b. Finish (respond to the user) if the agent did not ask to run tools\n  * Normal edge: after the tools are invoked, the graph should always return to the agent to decide what to do next\n\nCompile the graph.\n\n  * When we compile the graph, we turn it into a LangChain Runnable, which automatically enables calling `.invoke()`, `.stream()` and `.batch()` with your inputs \n  * We can also optionally pass checkpointer object for persisting state between graph runs, and enabling memory, human-in-the-loop workflows, time travel and more. In our case we use `MemorySaver` \\- a simple in-memory checkpointer \n\nExecute the graph.\n\n  1. LangGraph adds the input message to the internal state, then passes the state to the entrypoint node, `\"agent\"`.\n  2. The `\"agent\"` node executes, invoking the chat model.\n  3. The chat model returns an `AIMessage`. LangGraph adds this to the state.\n  4. Graph cycles the following steps until there are no more `tool_calls` on `AIMessage`: \n     * If `AIMessage` has `tool_calls`, `\"tools\"` node executes\n     * The `\"agent\"` node executes again and returns `AIMessage`\n  5. Execution progresses to the special `END` value and outputs the final state. And as a result, we get a list of all our chat messages as output.\n\n\n\n## Documentation¶\n\n  * Tutorials: Learn to build with LangGraph through guided examples.\n  * How-to Guides: Accomplish specific things within LangGraph, from streaming, to adding memory & persistence, to common design patterns (branching, subgraphs, etc.), these are the place to go if you want to copy and run a specific code snippet.\n  * Conceptual Guides: In-depth explanations of the key concepts and principles behind LangGraph, such as nodes, edges, state and more.\n  * API Reference: Review important classes and methods, simple examples of how to use the graph and checkpointing APIs, higher-level prebuilt components and more.\n  * LangGraph Platform: LangGraph Platform is a commercial solution for deploying agentic applications in production, built on the open-source LangGraph framework.\n\n\n\n## Resources¶\n\n  * Built with LangGraph: Hear how industry leaders use LangGraph to ship powerful, production-ready AI applications.\n\n\n\n## Contributing¶\n\nFor more information on how to contribute, see here.\n",
    "metadata": {
        "url": "https://langchain-ai.github.io/langgraph/",
        "title": "Home",
        "description": "Build language agents as graphs",
        "keywords": "No keywords"
    }
}