{
    "page_content": "# How-to guides¶\n\nHere you’ll find answers to “How do I...?” types of questions. These guides are **goal-oriented** and concrete; they're meant to help you complete a specific task. For conceptual explanations see the Conceptual guide. For end-to-end walk-throughs see Tutorials. For comprehensive descriptions of every class and function see the API Reference.\n\n## Installation¶\n\n  * How to install and manage dependencies\n  * How to use LangGraph.js in web environments\n\n\n\n## LangGraph¶\n\n### Controllability¶\n\nLangGraph.js is known for being a highly controllable agent framework. These how-to guides show how to achieve that controllability.\n\n  * How to create branches for parallel execution\n  * How to create map-reduce branches for parallel execution\n  * How to combine control flow and state updates with Command\n\n\n\n### Persistence¶\n\nLangGraph.js makes it easy to persist state across graph runs. The guides below shows how to add persistence to your graph.\n\n  * How to add thread-level persistence to your graph\n  * How to add thread-level persistence to subgraphs\n  * How to add cross-thread persistence\n  * How to use a Postgres checkpointer for persistence\n\n\n\nSee the below guides for how-to add persistence to your workflow using the (beta) Functional API:\n\n  * How to add thread-level persistence (functional API)\n  * How to add cross-thread persistence (functional API)\n\n\n\n### Memory¶\n\nLangGraph makes it easy to manage conversation memory in your graph. These how-to guides show how to implement different strategies for that.\n\n  * How to manage conversation history\n  * How to delete messages\n  * How to add summary of the conversation history\n  * How to add long-term memory (cross-thread)\n  * How to use semantic search for long-term memory\n\n\n\n### Human-in-the-loop¶\n\nHuman-in-the-loop functionality allows you to involve humans in the decision-making process of your graph. These how-to guides show how to implement human-in-the-loop workflows in your graph.\n\nKey workflows:\n\n  * How to wait for user input: A basic example that shows how to implement a human-in-the-loop workflow in your graph using the `interrupt` function.\n  * How to review tool calls: Incorporate human-in-the-loop for reviewing/editing/accepting tool call requests before they executed using the `interrupt` function.\n\n\n\nOther methods:\n\n  * How to add static breakpoints: Use for debugging purposes. For **human-in-the-loop** workflows, we recommend the `interrupt` function instead.\n  * How to edit graph state: Edit graph state using `graph.update_state` method. Use this if implementing a **human-in-the-loop** workflow via **static breakpoints**.\n  * How to add dynamic breakpoints with `NodeInterrupt`: **Not recommended** : Use the `interrupt` function instead.\n\n\n\nSee the below guides for how-to implement human-in-the-loop workflows with the (beta) Functional API:\n\n  * How to wait for user input (Functional API)\n  * How to review tool calls (Functional API)\n\n\n\n### Time Travel¶\n\nTime travel allows you to replay past actions in your LangGraph application to explore alternative paths and debug issues. These how-to guides show how to use time travel in your graph.\n\n  * How to view and update past graph state\n\n\n\n### Streaming¶\n\nLangGraph is built to be streaming first. These guides show how to use different streaming modes.\n\n  * How to stream the full state of your graph\n  * How to stream state updates of your graph\n  * How to stream LLM tokens\n  * How to stream LLM tokens without LangChain models\n  * How to stream custom data\n  * How to configure multiple streaming modes\n  * How to stream events from within a tool\n  * How to stream from the final node\n\n\n\n### Tool calling¶\n\n  * How to call tools using ToolNode\n  * How to force an agent to call a tool\n  * How to handle tool calling errors\n  * How to pass runtime values to tools\n  * How to update graph state from tools\n\n\n\n### Subgraphs¶\n\nSubgraphs allow you to reuse an existing graph from another graph. These how-to guides show how to use subgraphs:\n\n  * How to add and use subgraphs\n  * How to view and update state in subgraphs\n  * How to transform inputs and outputs of a subgraph\n\n\n\n### Multi-agent¶\n\n  * How to build a multi-agent network\n  * How to add multi-turn conversation in a multi-agent application\n\n\n\nSee the multi-agent tutorials for implementations of other multi-agent architectures.\n\nSee the below guides for how-to implement multi-agent workflows with the (beta) Functional API:\n\n  * How to build a multi-agent network (functional API)\n  * How to add multi-turn conversation in a multi-agent application (functional API)\n\n\n\n### State management¶\n\n  * How to define graph state\n  * Have a separate input and output schema\n  * Pass private state between nodes inside the graph\n\n\n\n### Other¶\n\n  * How to add runtime configuration to your graph\n  * How to add node retries\n  * How to let agent return tool results directly\n  * How to have agent respond in structured format\n  * How to manage agent steps\n\n\n\n### Prebuilt ReAct Agent¶\n\n  * How to create a ReAct agent\n  * How to add memory to a ReAct agent\n  * How to add a system prompt to a ReAct agent\n  * How to add Human-in-the-loop to a ReAct agent\n  * How to return structured output from a ReAct agent\n\n\n\nSee the below guide for how-to build ReAct agents with the (beta) Functional API:\n\n  * How to create a ReAct agent from scratch (Functional API)\n\n\n\n## LangGraph Platform¶\n\nThis section includes how-to guides for LangGraph Platform.\n\nLangGraph Platform is a commercial solution for deploying agentic applications in production, built on the open-source LangGraph framework. It provides four deployment options to fit a range of needs: a free tier, a self-hosted version, a cloud SaaS, and a Bring Your Own Cloud (BYOC) option. You can explore these options in detail in the deployment options guide.\n\nTip\n\n  * LangGraph is an MIT-licensed open-source library, which we are committed to maintaining and growing for the community.\n  * You can always deploy LangGraph applications on your own infrastructure using the open-source LangGraph project without using LangGraph Platform.\n\n\n\n### Application Structure¶\n\nLearn how to set up your app for deployment to LangGraph Platform:\n\n  * How to set up app for deployment (requirements.txt)\n  * How to set up app for deployment (pyproject.toml)\n  * How to set up app for deployment (JavaScript)\n  * How to customize Dockerfile\n  * How to test locally\n\n\n\n### Deployment¶\n\nLangGraph applications can be deployed using LangGraph Cloud, which provides a range of services to help you deploy, manage, and scale your applications.\n\n  * How to deploy to LangGraph cloud\n  * How to deploy to a self-hosted environment\n  * How to interact with the deployment using RemoteGraph\n\n\n\n### Assistants¶\n\nAssistants are a configured instance of a template.\n\n  * How to configure agents\n  * How to version assistants\n\n\n\n### Threads¶\n\n  * How to copy threads\n  * How to check status of your threads\n\n\n\n### Runs¶\n\nLangGraph Cloud supports multiple types of runs besides streaming runs.\n\n  * How to run an agent in the background\n  * How to run multiple agents in the same thread\n  * How to create cron jobs\n  * How to create stateless runs\n\n\n\n### Streaming¶\n\nStreaming the results of your LLM application is vital for ensuring a good user experience, especially when your graph may call multiple models and take a long time to fully complete a run. Read about how to stream values from your graph in these how to guides:\n\n  * How to stream values\n  * How to stream updates\n  * How to stream messages\n  * How to stream events\n  * How to stream in debug mode\n  * How to stream multiple modes\n\n\n\n### Human-in-the-loop¶\n\nWhen creating complex graphs, leaving every decision up to the LLM can be dangerous, especially when the decisions involve invoking certain tools or accessing specific documents. To remedy this, LangGraph allows you to insert human-in-the-loop behavior to ensure your graph does not have undesired outcomes. Read more about the different ways you can add human-in-the-loop capabilities to your LangGraph Cloud projects in these how-to guides:\n\n  * How to add a breakpoint\n  * How to wait for user input\n  * How to edit graph state\n  * How to replay and branch from prior states\n  * How to review tool calls\n\n\n\n### Double-texting¶\n\nGraph execution can take a while, and sometimes users may change their mind about the input they wanted to send before their original input has finished running. For example, a user might notice a typo in their original request and will edit the prompt and resend it. Deciding what to do in these cases is important for ensuring a smooth user experience and preventing your graphs from behaving in unexpected ways. The following how-to guides provide information on the various options LangGraph Cloud gives you for dealing with double-texting:\n\n  * How to use the interrupt option\n  * How to use the rollback option\n  * How to use the reject option\n  * How to use the enqueue option\n\n\n\n### Webhooks¶\n\n  * How to integrate webhooks\n\n\n\n### Cron Jobs¶\n\n  * How to create cron jobs\n\n\n\n### LangGraph Studio¶\n\nLangGraph Studio is a built-in UI for visualizing, testing, and debugging your agents.\n\n  * How to connect to a LangGraph Cloud deployment\n  * How to connect to a local deployment\n  * How to test your graph in LangGraph Studio\n  * How to interact with threads in LangGraph Studio\n\n\n\n## Troubleshooting¶\n\nThese are the guides for resolving common errors you may find while building with LangGraph. Errors referenced below will have an `lc_error_code` property corresponding to one of the below codes when they are thrown in code.\n\n  * GRAPH_RECURSION_LIMIT\n  * INVALID_CONCURRENT_GRAPH_UPDATE\n  * INVALID_GRAPH_NODE_RETURN_VALUE\n  * MULTIPLE_SUBGRAPHS\n  * UNREACHABLE_NODE\n\n\n",
    "metadata": {
        "url": "https://langchain-ai.github.io/langgraphjs/how-tos/",
        "title": "How-to Guides",
        "description": "How to accomplish common tasks in LangGraph.js",
        "keywords": "No keywords"
    }
}