{
    "page_content": "# LangGraph Studio¶\n\nPrerequisites\n\n  * LangGraph Platform\n  * LangGraph Server\n\n\n\nLangGraph Studio offers a new way to develop LLM applications by providing a specialized agent IDE that enables visualization, interaction, and debugging of complex agentic applications.\n\nWith visual graphs and the ability to edit state, you can better understand agent workflows and iterate faster. LangGraph Studio integrates with LangSmith allowing you to collaborate with teammates to debug failure modes.\n\n## Features¶\n\nThe key features of LangGraph Studio are:\n\n  * Visualizes your graph\n  * Test your graph by running it from the UI\n  * Debug your agent by modifying its state and rerunning\n  * Create and manage assistants\n  * View and manage threads\n  * View and manage long term memory\n  * Add node input/outputs to LangSmith datasets for testing\n\n\n\n## Types¶\n\n### Development server with web UI¶\n\nYou can run a local in-memory development server that can be used to connect a local LangGraph app with a web version of the studio. For example, if you start the local server with `langgraph dev` (running at `http://127.0.0.1:2024` by default), you can connect to the studio by navigating to:\n[code] \n    https://smith.langchain.com/studio/?baseUrl=http://127.0.0.1:2024\n    \n[/code]\n\nSee instructions here for more information.\n\nThe web UI version of the studio will connect to your locally running server — your agent is still running locally and never leaves your device.\n\n### Cloud studio¶\n\nIf you have deployed your LangGraph application on LangGraph Platform (Cloud), you can access the studio as part of that\n\n### Desktop app¶\n\nLangGraph Studio is available as a desktop app for MacOS users.\n\nWhile in Beta, LangGraph Studio is available for free to all LangSmith users on any plan tier.\n\n## Studio FAQs¶\n\n### Why is my project failing to start?¶\n\nThere are a few reasons that your project might fail to start, here are some of the most common ones.\n\n#### Docker issues (desktop only)¶\n\nLangGraph Studio (desktop) requires Docker Desktop version 4.24 or higher. Please make sure you have a version of Docker installed that satisfies that requirement and also make sure you have the Docker Desktop app up and running before trying to use LangGraph Studio. In addition, make sure you have docker-compose updated to version 2.22.0 or higher.\n\n#### Configuration or environment issues¶\n\nAnother reason your project might fail to start is because your configuration file is defined incorrectly, or you are missing required environment variables.\n\nNote (desktop only)\n\nLangGraph Studio Desktop automatically populates `LANGCHAIN_*` environment variables for license verification and tracing, regardless of the contents of the `.env` file. All other environment variables defined in `.env` will be read as normal.\n\n#### Incorrect data region (desktop only)¶\n\nIf you receive a license verification error when attempting to start the LangGraph Server, you may be logged into the incorrect LangSmith data region. Ensure that you're logged into the correct LangSmith data region and ensure that the LangSmith account has access to LangGraph platform.\n\n  1. In the top right-hand corner, click the user icon and select `Logout`.\n  2. At the login screen, click the `Data Region` dropdown menu and select the appropriate data region. Then click `Login to LangSmith`.\n\n\n\n### How does interrupt work?¶\n\nWhen you select the `Interrupts` dropdown and select a node to interrupt the graph will pause execution before and after (unless the node goes straight to `END`) that node has run. This means that you will be able to both edit the state before the node is ran and the state after the node has ran. This is intended to allow developers more fine-grained control over the behavior of a node and make it easier to observe how the node is behaving. You will not be able to edit the state after the node has ran if the node is the final node in the graph.\n\n### How do I reload the app? (desktop only)¶\n\nIf you would like to reload the app, don't use Command+R as you might normally do. Instead, close and reopen the app for a full refresh.\n\n### How does automatic rebuilding work? (desktop only)¶\n\nOne of the key features of LangGraph Studio is that it automatically rebuilds your image when you change the source code. This allows for a super fast development and testing cycle which makes it easy to iterate on your graph. There are two different ways that LangGraph rebuilds your image: either by editing the image or completely rebuilding it.\n\n#### Rebuilds from source code changes¶\n\nIf you modified the source code only (no configuration or dependency changes!) then the image does not require a full rebuild, and LangGraph Studio will only update the relevant parts. The UI status in the bottom left will switch from `Online` to `Stopping` temporarily while the image gets edited. The logs will be shown as this process is happening, and after the image has been edited the status will change back to `Online` and you will be able to run your graph with the modified code!\n\n#### Rebuilds from configuration or dependency changes¶\n\nIf you edit your graph configuration file (`langgraph.json`) or the dependencies (either `pyproject.toml` or `requirements.txt`) then the entire image will be rebuilt. This will cause the UI to switch away from the graph view and start showing the logs of the new image building process. This can take a minute or two, and once it is done your updated image will be ready to use!\n\n### Why is my graph taking so long to startup? (desktop only)¶\n\nThe LangGraph Studio interacts with a local LangGraph API server. To stay aligned with ongoing updates, the LangGraph API requires regular rebuilding. As a result, you may occasionally experience slight delays when starting up your project.\n\n## Why are extra edges showing up in my graph?¶\n\nIf you don't define your conditional edges carefully, you might notice extra edges appearing in your graph. This is because without proper definition, LangGraph Studio assumes the conditional edge could access all other nodes. In order for this to not be the case, you need to be explicit about how you define the nodes the conditional edge routes to. There are two ways you can do this:\n\n### Solution 1: Include a path map¶\n\nThe first way to solve this is to add path maps to your conditional edges. A path map is just a dictionary or array that maps the possible outputs of your router function with the names of the nodes that each output corresponds to. The path map is passed as the third argument to the `add_conditional_edges` function like so:\n\nPythonJavascript\n[code] \n    graph.add_conditional_edges(\"node_a\", routing_function, {True: \"node_b\", False: \"node_c\"})\n    \n[/code]\n[code] \n    graph.addConditionalEdges(\"node_a\", routingFunction, { true: \"node_b\", false: \"node_c\" });\n    \n[/code]\n\nIn this case, the routing function returns either True or False, which map to `node_b` and `node_c` respectively.\n\n### Solution 2: Update the typing of the router (Python only)¶\n\nInstead of passing a path map, you can also be explicit about the typing of your routing function by specifying the nodes it can map to using the `Literal` python definition. Here is an example of how to define a routing function in that way:\n[code] \n    def routing_function(state: GraphState) -> Literal[\"node_b\",\"node_c\"]:\n        if state['some_condition'] == True:\n            return \"node_b\"\n        else:\n            return \"node_c\"\n    \n[/code]\n\n## Related¶\n\nFor more information please see the following:\n\n  * LangGraph Studio how-to guides\n\n\n\n## Comments\n",
    "metadata": {
        "url": "https://langchain-ai.github.io/langgraph/concepts/langgraph_studio/",
        "title": "LangGraph Studio",
        "description": "Build language agents as graphs",
        "keywords": "No keywords"
    }
}